
## --------------------------------------------------------------
## MeCabおよｂRMeCabについては
browseURL("https://sites.google.com/site/rmecab/")


download.file("https://github.com/IshidaMotohiro/tutorial2019/blob/master/df.Rdata?raw=true", destfile= "df.Rdata")
df <- read.csv("df.Rdata") 

## ------------------------------------------------------------------------
head(df)


## --------------------------------------------------------------
## # どんな単語があるのか

df$TERM  %>%  head(20)


## ------------------------------------------------------------------------
df[df$TERM=="開発" , ]


## ------------------------------------------------------------------------
df[rowSums(df[, c("文書1", "文書2", "文書3")]) > 5, ]



## --------------------------------------------------------------
df$合計 <- round(rowSums(df[, c("文書1", "文書2", "文書3")]), 2)え


## --------------------------------------------------------------
df %>% head()


## ------------------------------------------------------------------------
df$標準化 <- scale(df$合計)


## --------------------------------------------------------------
df %>% head()


## tidyなデータ処理
## --------------------------------------------------------------
## install.packages("tidyverse")
library(tidyverse)



## --------------------------------------------------------------
df %>% head()


## --------------------------------------------------------------
df %>% gather(key = Word,value = FREQ, 文書1, 文書2, 文書3) 


## ------------------------------------------------------------------------
tb <- tibble(
  Name = LETTERS[1:5],
  X = 1:5, 
  Y = X^2
)


## --------------------------------------------------------------
tb


## ------------------------------------------------------------------------
temp <- tb[tb$Name=="B",]
max(temp$Y)


## ------------------------------------------------------------------------
max(tb[tb$Name=="B", ]$Y)


## ------------------------------------------------------------------------
# max(df2[df2$Name=="B",]$m)
tb %>% 
  filter(Name == "B") %>% 
  select(Y) %>% max()


## ------------------------------------------------------------------------
tb %>% 
  select(Name, Y) %>% 
  arrange(desc(Name)) %>% 
  head()


## ------------------------------------------------------------------------
tb %>% filter(Y >= 5)


## ------------------------------------------------------------------------
tb2 <- tb
tb2$Y <- scale(tb2$Y)
head(tb2)


## ------------------------------------------------------------------------
tb %>% 
  mutate(Y2 = scale(Y)) %>% 
  head()


## --------------------------------------------------------------
dat <- data.frame(Y = 1:6, X1 = c("A", "A", "B", "B", "C", "C"), X2 = 2:7, X3 = 3:8)


## ------------------------------------------------------------------------
dat


## ------------------------------------------------------------------------
dat %>% mutate_if( is.numeric, log )


## ------------------------------------------------------------------------
dat %>% summarise( X2_mean = mean(X2), 
                   X2_sd = mean(X2))


## ------------------------------------------------------------------------
dat %>% summarise_if( is.numeric, mean )


## ------------------------------------------------------------------------
dat %>% summarise_if( is.numeric, list(mean, var))


## ------------------------------------------------------------------------
dat %>% summarise_if( is.numeric,  list(~mean(.), ~sd(.)))


## --------------------------------------------------------------
text <- "
Name|Time1|Time2|Time3
A|0.1|0.18|0.11
B|0.3|0.33|0.35
C|0.2|0.22|0.26
D|0.44|0.47|0.43
E|0.51|0.56|0.55
F|0.60|0.66|0.68
G|0.77|0.78|0.72
H|0.81|0.88|0.86
"
yoko <- read_delim(file = text, delim = "|")


## ------------------------------------------------------------------------
yoko %>% head()




## --------------------------------------------------------------
yoko2 <-yoko %>% gather(
  key = time, 
  value = score, -Name)
yoko2


## --------------------------------------------------------------
df %>% head()


## ---RMeCab の docDF() の返すオブジェクトを縦型に変更する ------------------
library(tidyverse)
tidy_df <- df %>% gather(key = Doc, value = FREQ,  文書1, 文書2, 文書3) 
tidy_tib <- as_tibble(tidy_df) # この操作は必須ではない

## ** tidy dataに対する操作
### *** 列を抽出する select() 　例：「文書1」 のレコードのみ取り出す方法。 Doc 列が「文書１」であるレコードを抽出する
#### - tidyな形式の場合に
tidy_tib  %>% filter( Doc == "文書1" ) 

#### - messy な形式の場合は「列名」として指定する
df %>% select( 文書1 ) 


### *** 列の検索 filter() 　例：単語が「理工」であるレコード、あるいは品詞が「名詞ないし形容詞ないし動詞」であるレコードを抽出する方法。
#### - tidyデータの場合

tidy_tib  %>% filter( TERM  == "理工" )
tidy_tib  %>% filter( POS1 %in% c("名詞", "形容詞", "動詞") )

#### - messyな場合も同じ
df %>% filter( TERM == "理工" )
df %>% filter( POS1 %in% c("名詞", "形容詞", "動詞") )


### *** 列の追加 mutate() + group_by() + summarise() 　例：文書の違いを無視して、単語（TERM列）でまとめて合計する。
#### - tidyデータの場合 `tyd_tb` には例えば「。」が３行ある。文書が３種類あり、それぞれごとに頻度が計算されているからである。そこで文書３つを統合した頻度を知りたいとする。

tidy_tb %>% filter(TERM == "。") 
tidy_tib  %>% group_by(TERM, POS1, POS2) %>% summarize(FREQ = sum(FREQ)) 

#### - messyな場合  新たに「合計」という列を追加する。 ただし、横（行）方向に合計をとる必要があるので `rowwise()` 併用し各文書での単語出現頻度を合計する
df %>% rowwise() %>% mutate(合計 = sum(文書1, 文書2, 文書3))



### ***  列の要約  例：summarize()　文書ごとの総語数を数える

#### - tidyデータの場合

tidy_tib %>% group_by(Doc) %>% summarise(FREQ = sum(FREQ))

#### - messyな場合　# 数値が記録された列を指定して（is.numeric）合計を求める
df %>% summarize_if(is.numeric, sum)



##退屈なことはRにやらせよう：詳細はseiseki_Demo.Rを参照
## ------------------------------------------------------------------------
学生番号 <- stri_trans_nfkc_casefold(
 "１０１８０５１４５８石田基広.xlsx") %>%
     str_extract(
     "\\d{8,10}\\p{Han}*.xlsx$")


## --------------------------------------------------------------
学生番号


## ggplot2

## ------グラフィックスの日本語設定------------------------------------------------------------------
source("http://rmecab.jp/R/Rprofile.R")


## ---------- messyな形式からtidyな形式に変換が必要 ----------------------------------------------------
doc <- df %>% gather(key = Doc, 
  value = FREQ, 
  文書1, 文書2, 文書3) 


## ------------------------------------------------------------------------
p <- doc %>% 
  ggplot(aes(POS1,
             FREQ,
             fill=Doc)) +
  geom_bar(stat = 
             "identity")


## --------------------------------------------------------------
p


## --------------------------------------------------------------
## install.packages("gapminder")
library(gapminder)


## --------------------------------------------------------------
yr <- gapminder %>%  select(-c(pop, gdpPercap)) %>% spread(key = year , value =  lifeExp)
yr



## ------------------------------------------------------------------------
gapminder <- gapminder %>%  
  filter(country %in% 
           c("Japan", "China", "Korea, Rep.")) 


## ------------------------------------------------------------------------
library(ggplot2)
p <- gapminder %>% 
  ggplot() 
# ggplot(gapminder)


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- p +
  aes(x = year, 
      y = lifeExp,
      size = pop,
      col = country)


## --------------------------------------------------------------
p


## --------------------------------------------------------------
## gapminder %>%
##   ggplot(aes(x = year, y = lifeExp,
##          size = pop,col = country))


## ------------------------------------------------------------------------
p <- p + geom_point() 


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p0 <- gapminder  %>% 
  ggplot(aes(
   x = year, 
   y = lifeExp, 
   size = pop))  +
  geom_point(
    show.legend = 
    FALSE,
    col = "red") #👈


## --------------------------------------------------------------
p0


## ------------------------------------------------------------------------
gapminder %>% 
  group_by(year) %>% 
  summarise(AVG = mean(gdpPercap)) 


## ------------------------------------------------------------------------
p <- gapminder %>% 
  ggplot(aes(year, 
    gdpPercap)) +
  geom_bar(stat = 
    "summary",
    fun.y = "mean")


## --------------------------------------------------------------
p


## --------------------------------------------------------------
gap_avg <- gapminder %>% 
  group_by(year) %>% 
  summarise(AVG = mean(gdpPercap)) 


## ------------------------------------------------------------------------
gap_avg


## ------------------------------------------------------------------------
p <- gap_avg %>% 
  ggplot(
   aes(year, AVG)) +
  geom_bar(
  stat ="identity")


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- gapminder %>% 
  ggplot(aes(year, 
    gdpPercap)) +
  stat_summary(
    geom = "bar",
    fun.y = "mean") +
  stat_summary(
    geom = "errorbar",
    fun.data = "mean_se")



## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- doc %>% 
  ggplot(aes(POS1,
             FREQ,
        fill = Doc)) +
  geom_bar(stat =
      "identity")


## ------------------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- gapminder %>% 
  filter(country == "China") %>% 
  ggplot(aes(lifeExp)) +
  geom_histogram()


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- gapminder %>% 
  filter(country == "China") %>% 
  ggplot(aes(lifeExp)) +
  geom_histogram(bins = 6)


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- gapminder %>% 
  filter(country == "China") %>% 
  ggplot(aes(lifeExp,
    y = ..density.. )) +
  geom_histogram(bins = 6)


## ------------------------------------------------------------------------
p + geom_density()


## ------------------------------------------------------------------------
p <- gapminder %>% 
  ggplot(aes(year, 
    lifeExp,
    group=country)) +
  geom_line()


## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p <- gapminder %>% 
  ggplot(
   aes(x=country, 
       y=gdpPercap)) +
  geom_boxplot()



## --------------------------------------------------------------
p


## ------------------------------------------------------------------------
p_f <- p + 
  facet_grid(. 
    ~ country)


## ------------------------------------------------------------------------
p_f


## ------------------------------------------------------------------------
p_f <- p + 
  facet_grid(. 
    ~ country,
    scales = "free")


## ------------------------------------------------------------------------
p_f


## ------------------------------------------------------------------------
p <- p +
  theme_classic()


## --------------------------------------------------------------
p 

